- import reqired packages

In [8]:
import numpy as np
import pandas as pd
file_path = r"C:\Users\user\OneDrive\NareshIT\DataScience\EDA\Visadataset.csv"
visa_df = pd.read_csv(file_path)
type(visa_df)

pandas.core.frame.DataFrame

#head

In [9]:
visa_df.head() # frist five rows

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [10]:
visa_df.tail() # last five rows

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.57,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.79,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.85,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.77,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.91,Year,Y,Certified

In [11]:
visa_df() # last five and frist rows

TypeError: 'DataFrame' object is not callable

In [13]:
visa_df.shape

(25480, 12)

In [14]:
visa_df.shape[0]

25480

In [15]:
visa_df.shape[1]

12

In [16]:
visa_df.shape[1]*visa_df.shape[0]

305760

In [24]:
cols = visa_df.columns
# It will provide all 12 columns
cols

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [26]:
cols_list = cols.to_list()
type(cols_list)

list

In [ ]:
# Select cell
# CRTL +A
# CTRL +/
# cols=visa_df.columns
# for i in cols:
#      print(i.capitalize())

$dtypes$

In [28]:
visa_df.dtypes
# object : the values under that column are categorical
# int/float : that values under the column are numarical

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [29]:
type(visa_df.dtypes)

pandas.core.series.Series

$info$

In [30]:
visa_df.info()
# Case study 25400
# out of  25480 rows 80 values are missed : NUll
# Null count 80
# Non null count 25400

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB

$isnull$

In [34]:
visa_df.isnull() # 
visa_df.isnull().sum()
visa_df.isna()
visa_df.isna().sum()

case_id                  0
continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

- **Not callable**

    - It is not a function but you provided brackets

    - Remove brackets

- **Bound method or built in functions**
    
    - please provide brackts

- **Attribute Error**

    - You provided a method which does not have 
    
    - Please check the spelling
    
    - or use dir to check the method existed or not

In [44]:
visa_df.dtypes
dtype = dict(visa_df.dtypes)
# for i in dtype:
#     if dtype[i]=='object':
#         print(i, dtype[i])

# cat_cal=[i for i in dtype if dtype[i]=='object']
# nul_cal=[i for i in dtype if dtype[i]!='object']
# cat_cal, nul_cal

(['case_id',
  'continent',
  'education_of_employee',
  'has_job_experience',
  'requires_job_training',
  'region_of_employment',
  'unit_of_wage',
  'full_time_position',
  'case_status'],
 ['no_of_employees', 'yr_of_estab', 'prevailing_wage'])

In [46]:
visa_df.select_dtypes(include='object').columns
#visa_df.select_dtypes(exclude='object').columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

# You want some middle rows
# You want specfic rows
# You want some specific clumns data

$take$-$loc$-$iloc$

In [47]:
visa_df.take([1,2,3])
# by default axis=0===>rows
# provide the rows which has index 1, 2, 3 and call clumns

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.65,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.86,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.03,Year,Y,Denied

In [48]:
visa_df.take([1,2,3], axis=1)
# the output is columns
#

      continent education_of_employee has_job_experience
0          Asia           High School                  N
1          Asia              Master's                  Y
2          Asia            Bachelor's                  N
3          Asia            Bachelor's                  N
4        Africa              Master's                  Y
...         ...                   ...                ...
25475      Asia            Bachelor's                  Y
25476      Asia           High School                  Y
25477      Asia              Master's                  Y
25478      Asia              Master's                  Y
25479      Asia            Bachelor's                  Y

[25480 rows x 3 columns]

In [1]:
visa_df.take([100,200,300]).take([1,2], axis=1)

NameError: name 'visa_df' is not defined

In [2]:
import numpy as np
import pandas as pd
file_path = r"C:\Users\user\OneDrive\NareshIT\DataScience\EDA\Visadataset.csv"
visa_df = pd.read_csv(file_path)
type(visa_df)

pandas.core.frame.DataFrame

In [ ]:
visa_df.iloc[<rows>, <columns>]
visa_df.iloc[<start:end>, <start:end>]
visa_df.iloc[[rows index], [columns index]]

In [4]:
visa_df.iloc[5:10]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
5,EZYV06,Asia,Master's,Y,N,2339,2012,South,78252.1400,Year,Y,Certified
6,EZYV07,Asia,Bachelor's,N,N,4985,1994,South,53635.3900,Year,Y,Certified
7,EZYV08,North America,Bachelor's,Y,N,3035,1924,West,418.2298,Hour,Y,Denied
8,EZYV09,Asia,Bachelor's,N,N,4810,2012,Midwest,74362.1900,Year,Y,Certified
9,EZYV10,Europe,Doctorate,Y,N,2251,1995,South,67514.7600,Year,Y,Certified

In [6]:
visa_df.iloc[5:10, 2:6] # 5 to 9 index rows 2 to 5 index cloumn
visa_df.iloc[5:10, :] # All the cloumns, 5 to 9 index
visa_df.iloc[:,:2] #All the rows only 0 and 1 column

         case_id continent
0         EZYV01      Asia
1         EZYV02      Asia
2         EZYV03      Asia
3         EZYV04      Asia
4         EZYV05    Africa
...          ...       ...
25475  EZYV25476      Asia
25476  EZYV25477      Asia
25477  EZYV25478      Asia
25478  EZYV25479      Asia
25479  EZYV25480      Asia

[25480 rows x 2 columns]

In [7]:
rows = [100, 200, 300]
cols = [2, 7]
visa_df.iloc[rows, cols]

    education_of_employee region_of_employment
100              Master's            Northeast
200             Doctorate                 West
300              Master's              Midwest

In [10]:
rows = [100, 200, 300]
cols = ['education_of_employee','region_of_employment']
visa_df.loc[rows,cols]

    education_of_employee region_of_employment
100              Master's            Northeast
200             Doctorate                 West
300              Master's              Midwest

$note$